ExpirationService-master/app/controllers/promotions_controller.rb

INSERT INTO "promotions" ("name", "expiration", "created_at", "updated_at", "send") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Oracle"], ["expiration", "2019-10-09 00:38:11"], ["created_at", "2019-11-27 03:47:59.996945"], ["updated_at", "2019-11-27 03:47:59.996945"], ["send", 1]]
---
    def addPromotion
      promotionExpiration = request.headers['expiration']
      promotionName = request.headers['name']
      Promotion.create(name: promotionName, expiration: promotionExpiration, send: 1)